# AssetPropertyList Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyList Class
Members See Also
---
Represents a list of AssetProperty(s).
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class AssetPropertyList : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyList _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyList : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyList
# See Also
AssetPropertyList Members
Autodesk.Revit.DB.Visual Namespace